ocaml-book.org
#+TITLE: OCaml 杂记
#+OPTIONS: toc:t num:nil  timestamp:nil 

#+HTML_HEAD:  <link rel="stylesheet" type="text/css" href="./myorg.css"/>



* opam包管理器



~opam install XX~

#+begin_src sh
opam install -y utop odoc ounit2 qcheck bisect_ppx menhir ocaml-lsp-server ocamlformat ocamlformat-rpc
#+end_src

* utop交互式解释器

每次启动utop都会自动加载 ~.ocamlinit~ 文件，它会自动执行脚本，
使得不用每次都手动加载库

#+begin_src ocaml
  #use "topfind";;
  #thread;;
  #require "core.top";;
  
#+end_src

** Exit utop

#+begin_src ocaml
  #quit;; 
#+end_src

#+begin_src ocaml
exit 0;;
#+end_src



* 配置Emacs支持ocaml | Configure EMACS supports Ocaml

#+begin_src ocaml
opam install tuareg ocp-indent merlin
opam install user-setup
opam user-setup install
#+end_src


* 编译ocamlc

#+begin_src sh
ocamlc -o test.byte test.ml 
#+end_src
这和gcc类似，不同的是它还会产生中间文件： ~test.cmi test.cmo~


** main()函数？

ocaml中没有专门的main函数，文件（指的是dune中name命令指定的那个）中最后一个函数定义将作为整个程序的入口。

** 构建系统Dune

+ 用dune创建项目根目录 Create a project root directory with dune
  #+begin_src sh
    dune init project dirname
  #+end_src

+ create a file named dune in the project root directory
  
  #+begin_src elisp
    (executable
      (name XX) ;;XX为main函数所在文件的名字
      ;;(libraries yyy) ;; erung: ounit2
      )
  #+end_src

+  Generate executable file

  #+begin_src sh
    dune build XX.exe 
  #+end_src

+  run project
  #+begin_src sh
    # Manually
    ./_build/default/XX.exe

    # automatic
    dune exec ./XX.exe
  #+end_src

+ Clean up the _build directory
  #+begin_src sh
    dune clean # remove the _build directory 
  #+end_src




* ocaml的显著差别


** 递归函数要用 ~rec~ 标记

#+begin_src ocaml
  let rec append lst1 lst2 =
    match lst1 with
    | [] -> lst2
    | h :: t -> h :: (append t lst2 )
  ;;
#+end_src


** 严格区分整数和浮点数的运算：

int： ~0 + - * /  abs~ 

float:  ~0. +. -. *. /. ~


** 连接字符串: 用 ~^~

#+begin_src ocaml
"hello" ^ "world" 
#+end_src


* let 不是表达式


#+begin_src ocaml

utop # let x = 3;;
val x : int = 3

utop # (fun x y -> x * y);;
- : int -> int -> int = <fun>

utop # (fun x y -> x * y) 4 5;;
- : int = 20

utop # let multf x y = x *. y;;
val multf : float -> float -> float = <fun>

utop # multf 1. 4.;;
- : float = 4.
#+end_src

