ocaml-book.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml 杂记</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./myorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml 杂记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6f22633">opam包管理器</a></li>
<li><a href="#org26327f6">utop交互式解释器</a>
<ul>
<li><a href="#org771c979">Exit utop</a></li>
</ul>
</li>
<li><a href="#org7285263">配置Emacs支持ocaml | Configure EMACS supports Ocaml</a></li>
<li><a href="#orgf63bb25">编译ocamlc</a>
<ul>
<li><a href="#org6b0eb6f">main()函数？</a></li>
<li><a href="#orgc13537d">构建系统Dune</a></li>
</ul>
</li>
<li><a href="#orgcc5f4d2">ocaml的显著差别</a>
<ul>
<li><a href="#org185b549">递归函数要用 <code>rec</code> 标记</a></li>
<li><a href="#org0bd4d4f">严格区分整数和浮点数的运算：</a></li>
<li><a href="#org8b434dd">连接字符串: 用 <code>^</code></a></li>
</ul>
</li>
<li><a href="#org789fbef">let 不是表达式</a></li>
<li><a href="#org78f12b7">let &#x2026; in &#x2026;表达式</a></li>
<li><a href="#org4de160d">运算符</a>
<ul>
<li><a href="#org65a964f">用括号定义标点符号</a></li>
<li><a href="#org87aa725">运算符@@ 分隔开函数和参数</a></li>
<li><a href="#org84a921e">运算符|&gt; 管道符</a></li>
<li><a href="#org257e23b">文档</a></li>
<li><a href="#orga412f5f">打印</a>
<ul>
<li><a href="#org5ba3890">格式化输出</a></li>
<li><a href="#org5c4ce47">格式化字符串</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd5b11e8">list</a>
<ul>
<li><a href="#org7b1fdeb">创建list</a></li>
<li><a href="#orgd5dab6e">用 <code>@</code> 连接两个list</a></li>
<li><a href="#org5f957ba">通过模式匹配 访问元素</a></li>
</ul>
</li>
<li><a href="#org9e50ae3">OUnit2</a>
<ul>
<li><a href="#org79c5c1a">打印测试用例出错时的值</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org6f22633" class="outline-2">
<h2 id="org6f22633">opam包管理器</h2>
<div class="outline-text-2" id="text-org6f22633">
<p>
<code>opam install XX</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">opam install -y utop odoc ounit2 qcheck bisect_ppx menhir ocaml-lsp-server ocamlformat ocamlformat-rpc
</pre>
</div>
</div>
</div>

<div id="outline-container-org26327f6" class="outline-2">
<h2 id="org26327f6">utop交互式解释器</h2>
<div class="outline-text-2" id="text-org26327f6">
<p>
每次启动utop都会自动加载 <code>.ocamlinit</code> 文件，它会自动执行脚本，
使得不用每次都手动加载库
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">#</span>use <span style="color: #7bc275;">"topfind"</span><span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">#</span>thread<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">#</span>require <span style="color: #7bc275;">"core.top"</span><span style="color: #ff4500;">;;</span>

</pre>
</div>
</div>

<div id="outline-container-org771c979" class="outline-3">
<h3 id="org771c979">Exit utop</h3>
<div class="outline-text-3" id="text-org771c979">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">#</span>quit<span style="color: #ff4500;">;;</span> 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #C57BDB;">exit</span> 0<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org7285263" class="outline-2">
<h2 id="org7285263">配置Emacs支持ocaml | Configure EMACS supports Ocaml</h2>
<div class="outline-text-2" id="text-org7285263">
<div class="org-src-container">
<pre class="src src-ocaml">opam install tuareg ocp<span style="color: #f0e68c;">-</span>indent merlin
opam install user<span style="color: #f0e68c;">-</span>setup
opam user<span style="color: #f0e68c;">-</span>setup install
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf63bb25" class="outline-2">
<h2 id="orgf63bb25">编译ocamlc</h2>
<div class="outline-text-2" id="text-orgf63bb25">
<div class="org-src-container">
<pre class="src src-sh">ocamlc -o test.byte test.ml 
</pre>
</div>
<p>
这和gcc类似，不同的是它还会产生中间文件： <code>test.cmi test.cmo</code>
</p>
</div>


<div id="outline-container-org6b0eb6f" class="outline-3">
<h3 id="org6b0eb6f">main()函数？</h3>
<div class="outline-text-3" id="text-org6b0eb6f">
<p>
ocaml中没有专门的main函数，文件（指的是dune中name命令指定的那个）中最后一个函数定义将作为整个程序的入口。
</p>
</div>
</div>

<div id="outline-container-orgc13537d" class="outline-3">
<h3 id="orgc13537d">构建系统Dune</h3>
<div class="outline-text-3" id="text-orgc13537d">
<ul class="org-ul">
<li><p>
用dune创建项目根目录 Create a project root directory with dune
</p>
<div class="org-src-container">
<pre class="src src-sh">dune init project dirname
</pre>
</div></li>

<li><p>
create a file named dune in the project root directory
</p>

<div class="org-src-container">
<pre class="src src-elisp">(executable
  (name XX) <span style="color: #62686E;">;;</span><span style="color: #62686E;">XX&#20026;main&#20989;&#25968;&#25152;&#22312;&#25991;&#20214;&#30340;&#21517;&#23383;</span>
  <span style="color: #62686E;">;;</span><span style="color: #62686E;">(libraries yyy) ;; erung: ounit2</span>
  )
</pre>
</div></li>

<li><p>
Generate executable file
</p>

<div class="org-src-container">
<pre class="src src-sh">dune build XX.exe 
</pre>
</div></li>

<li><p>
run project
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #62686E;"># </span><span style="color: #62686E;">Manually</span>
./_build/default/XX.exe

<span style="color: #62686E;"># </span><span style="color: #62686E;">automatic</span>
dune exec ./XX.exe
</pre>
</div></li>

<li><p>
Clean up the _build directory
</p>
<div class="org-src-container">
<pre class="src src-sh">dune clean <span style="color: #62686E;"># </span><span style="color: #62686E;">remove the _build directory </span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgcc5f4d2" class="outline-2">
<h2 id="orgcc5f4d2">ocaml的显著差别</h2>
<div class="outline-text-2" id="text-orgcc5f4d2">
</div>
<div id="outline-container-org185b549" class="outline-3">
<h3 id="org185b549">递归函数要用 <code>rec</code> 标记</h3>
<div class="outline-text-3" id="text-org185b549">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="font-weight: bold;">rec</span> <span style="color: #5cEfFF;">append</span><span style="color: #DFDFDF;"> lst1 lst2</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">match</span> lst1 <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> lst2
  <span style="color: #f0e68c;">|</span> h <span style="color: #f0e68c;">::</span> t <span style="color: #f0e68c;">-&gt;</span> h <span style="color: #f0e68c;">::</span> <span style="color: #f0e68c;">(</span>append t lst2 <span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org0bd4d4f" class="outline-3">
<h3 id="org0bd4d4f">严格区分整数和浮点数的运算：</h3>
<div class="outline-text-3" id="text-org0bd4d4f">
<p>
int： <code>0 + - * /  abs</code> 
</p>

<p>
float:  ~0. +. -. *. /. ~
</p>
</div>
</div>


<div id="outline-container-org8b434dd" class="outline-3">
<h3 id="org8b434dd">连接字符串: 用 <code>^</code></h3>
<div class="outline-text-3" id="text-org8b434dd">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"hello"</span> <span style="color: #f0e68c;">^</span> <span style="color: #7bc275;">"world"</span> 
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org789fbef" class="outline-2">
<h2 id="org789fbef">let 不是表达式</h2>
<div class="outline-text-2" id="text-org789fbef">
<div class="org-src-container">
<pre class="src src-ocaml">
utop <span style="color: #f0e68c;">#</span> <span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">x</span> <span style="color: #f0e68c;">=</span> 3<span style="color: #ff4500;">;;</span>
<span style="font-weight: bold;">val</span> <span style="color: #5cEfFF;">x</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 3

utop <span style="color: #f0e68c;">#</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x y</span> <span style="color: #f0e68c;">-&gt;</span> x <span style="color: #f0e68c;">*</span> y<span style="color: #f0e68c;">)</span><span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>

utop <span style="color: #f0e68c;">#</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x y</span> <span style="color: #f0e68c;">-&gt;</span> x <span style="color: #f0e68c;">*</span> y<span style="color: #f0e68c;">)</span> 4 5<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 20

utop <span style="color: #f0e68c;">#</span> <span style="font-weight: bold;">let</span> <span style="color: #5cEfFF;">multf</span><span style="color: #DFDFDF;"> x y</span> <span style="color: #f0e68c;">=</span> x <span style="color: #f0e68c;">*.</span> y<span style="color: #ff4500;">;;</span>
<span style="font-weight: bold;">val</span> <span style="color: #5cEfFF;">multf</span> <span style="color: #f0e68c;">:</span> float <span style="color: #f0e68c;">-&gt;</span> float <span style="color: #f0e68c;">-&gt;</span> float <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>

utop <span style="color: #f0e68c;">#</span> multf 1. 4.<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> float <span style="color: #f0e68c;">=</span> 4.
</pre>
</div>
</div>
</div>
