ocaml-book.html

<div id="outline-container-org78f12b7" class="outline-2">
<h2 id="org78f12b7">let &#x2026; in &#x2026;表达式</h2>
<div class="outline-text-2" id="text-org78f12b7">
<p>
在utop环境下，所有的let定义都会被转化成层层嵌套的let..in..表达式。
因此在表面上好像是支持了改变变量的值。
</p>


<p>
There must be parentheses here:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">a</span> <span style="color: #f0e68c;">=</span> 19 <span style="font-weight: bold;">in</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x</span> <span style="color: #f0e68c;">-&gt;</span> x <span style="color: #f0e68c;">+</span> a<span style="color: #f0e68c;">)</span>  19<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 38
</pre>
</div>


<p>
本质上在ocaml中不存在多参函数，所谓的多参函数只是语法糖：
</p>

<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="font-weight: bold;">let</span> <span style="color: #5cEfFF;">multargs</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">y</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">(</span> <span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">z</span> <span style="color: #f0e68c;">-&gt;</span> x<span style="color: #f0e68c;">+</span>y<span style="color: #f0e68c;">+</span>z <span style="color: #f0e68c;">))</span> <span style="color: #ff4500;">;;</span>
<span style="font-weight: bold;">val</span> <span style="color: #5cEfFF;">multargs</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>

utop <span style="color: #f0e68c;">#</span> multargs 1 2 3 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 6

utop <span style="color: #f0e68c;">#</span> <span style="font-weight: bold;">let</span> <span style="color: #5cEfFF;">same_as_multargs</span><span style="color: #DFDFDF;"> x y z</span> <span style="color: #f0e68c;">=</span> x<span style="color: #f0e68c;">+</span>y<span style="color: #f0e68c;">+</span>z <span style="color: #ff4500;">;;</span>
<span style="font-weight: bold;">val</span> <span style="color: #5cEfFF;">same_as_multargs</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>

utop <span style="color: #f0e68c;">#</span> same_as_multargs 1 2 3<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 6
</pre>
</div>



<p>
范型：带撇的类型名 'a  'b 
</p>
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="font-weight: bold;">let</span> <span style="color: #5cEfFF;">foo</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">fun</span> <span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">n </span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;"> int </span><span style="color: #f0e68c;">)</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">x </span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;"> 'a</span><span style="color: #f0e68c;">)</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">y </span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;"> 'a</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span>  <span style="color: #51afef;">if</span> n <span style="color: #f0e68c;">&gt;</span> 0 <span style="color: #51afef;">then</span> x <span style="color: #51afef;">else</span> y <span style="color: #ff4500;">;;</span>
<span style="font-weight: bold;">val</span> <span style="color: #5cEfFF;">foo</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">-&gt;</span> 'a <span style="color: #f0e68c;">-&gt;</span> 'a <span style="color: #f0e68c;">-&gt;</span> 'a <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>

utop <span style="color: #f0e68c;">#</span> foo <span style="color: #f0e68c;">-</span>1 <span style="color: #7bc275;">"hello"</span> <span style="color: #7bc275;">"fuck"</span> <span style="color: #ff4500;">;;</span>
<span style="color: #bbc2cf; background-color: #242730;">Error</span><span style="color: #f0e68c;">:</span> <span style="color: #bbc2cf; background-color: #242730;">This</span> expression has <span style="font-weight: bold;">type</span> <span style="color: #FCCE7B;">int</span> <span style="color: #f0e68c;">-&gt;</span> 'a <span style="color: #f0e68c;">-&gt;</span> 'a <span style="color: #f0e68c;">-&gt;</span> 'a
but an expression was expected <span style="color: #51afef;">of</span> <span style="font-weight: bold;">type</span> <span style="color: #FCCE7B;">int</span>

utop <span style="color: #f0e68c;">#</span> foo 3 <span style="color: #7bc275;">"hello"</span> <span style="color: #7bc275;">"fuck"</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"hello"</span>

utop <span style="color: #f0e68c;">#</span> foo <span style="color: #f0e68c;">(-</span>1<span style="color: #f0e68c;">)</span>  <span style="color: #7bc275;">"hello"</span> <span style="color: #7bc275;">"fuck"</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"fuck"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org4de160d" class="outline-2">
<h2 id="org4de160d">运算符</h2>
<div class="outline-text-2" id="text-org4de160d">
</div>
<div id="outline-container-org65a964f" class="outline-3">
<h3 id="org65a964f">用括号定义标点符号</h3>
</div>


<div id="outline-container-org87aa725" class="outline-3">
<h3 id="org87aa725">运算符@@ 分隔开函数和参数</h3>
<div class="outline-text-3" id="text-org87aa725">
<p>
主要是为了避免空格分割导致参数的识别不正常：
</p>
<div class="org-src-container">
<pre class="src src-ocaml">utop<span style="color: #f0e68c;">[</span>3<span style="color: #f0e68c;">]&gt;</span> succ 3<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 4
utop<span style="color: #f0e68c;">[</span>4<span style="color: #f0e68c;">]&gt;</span> succ 1 <span style="color: #f0e68c;">*</span> 4 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 8
utop<span style="color: #f0e68c;">[</span>5<span style="color: #f0e68c;">]&gt;</span> succ <span style="color: #f0e68c;">(</span>1 <span style="color: #f0e68c;">*</span> 4<span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 5
utop<span style="color: #f0e68c;">[</span>6<span style="color: #f0e68c;">]&gt;</span> succ <span style="color: #f0e68c;">@@</span> 1 <span style="color: #f0e68c;">*</span> 4<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 5
</pre>
</div>
</div>
</div>

<div id="outline-container-org84a921e" class="outline-3">
<h3 id="org84a921e">运算符|&gt; 管道符</h3>
<div class="outline-text-3" id="text-org84a921e">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="color: #f0e68c;">(|&gt;)</span> x f <span style="color: #f0e68c;">=</span> f x  <span style="color: #ff4500;">;;</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-ocaml">  <span style="font-weight: bold;">let</span> <span style="color: #5cEfFF;">foo</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">:</span> <span style="color: #FCCE7B;">int</span> <span style="color: #f0e68c;">=</span> x<span style="color: #f0e68c;">*</span>x <span style="color: #f0e68c;">+</span>1<span style="color: #ff4500;">;;</span>
  <span style="font-weight: bold;">val</span> <span style="color: #5cEfFF;">foo</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>

  utop<span style="color: #f0e68c;">[</span>1<span style="color: #f0e68c;">]&gt;</span> foo 3<span style="color: #ff4500;">;;</span>
  <span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 10

  utop<span style="color: #f0e68c;">[</span>2<span style="color: #f0e68c;">]&gt;</span> 3 <span style="color: #f0e68c;">|&gt;</span> foo<span style="color: #ff4500;">;;</span>
  <span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 10

utop<span style="color: #f0e68c;">[</span>13<span style="color: #f0e68c;">]&gt;</span> succ <span style="color: #f0e68c;">(</span>foo <span style="color: #f0e68c;">(</span>foo 3<span style="color: #f0e68c;">))</span><span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 102
utop<span style="color: #f0e68c;">[</span>14<span style="color: #f0e68c;">]&gt;</span> 3 <span style="color: #f0e68c;">|&gt;</span> foo <span style="color: #f0e68c;">|&gt;</span> foo <span style="color: #f0e68c;">|&gt;</span> succ <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 102
</pre>
</div>
</div>
</div>





<div id="outline-container-org257e23b" class="outline-3">
<h3 id="org257e23b">文档</h3>
<div class="outline-text-3" id="text-org257e23b">
<p>
<code>(**  .. *)</code> 即是文档的格式。
用方括号包围起来的将会被导出为等宽字体。
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7e7e87;">(** [args] *)</span>
</pre>
</div>

<ul class="org-ul">
<li>前置条件
对参数含义的描述，以及对合法参数的约束，对动态类型的语言可能还要加上对参数类型的描述</li>
<li>后置条件：
对返回值的约定。对错误情况/异常抛出的约定</li>
</ul>
</div>
</div>
