ocaml-book.org
** 打印

print_xxx :返回类型为unit.

唯一一个类型是unit的值是 ~()~
类似于void，通常用于不关心输入参数/返回值时，这时候一般想利用函数的副作用。


在let in中要求我们必须为值进行绑定： x = val
对于返回类型为unit的函数：可以写成

#+begin_src ocaml
let _ = func args in ...
#+end_src

或者

#+begin_src ocaml
let () = func args in ...
#+end_src


#+begin_src ocaml
#
let ()  = print_endline "fuck" in 
let ()  = print_endline "your" in 
print_endline "mother" ;;
#+end_src

#+begin_src ocaml
fuck
your
mother
- : unit = ()
#+end_src

这种写法太繁琐了，可以像C中用逗号表达式分别对前面的表达式求值，但只将最后一个表达式的值返回。
在Ocaml中是用 ~;~ 来分割的：

#+begin_src ocaml
 "hello" ; 233  (* 这会发出警告 it will cause warnings*)
#+end_src

#+begin_src ocaml
- : int = 233 
#+end_src

因此可写成更简单的形式，而不用写成嵌套的 let..in..

#+begin_src ocaml
print_endline "fuck";
print_endline "your";
print_endline "mother"  (* 最后一个表达式后面无分号！ *)
#+end_src


在分号表达式中，若前面被忽略值的表达式的类型不是unit，则会发出警告。
通过ignore函数可以消除警告。

(ignore "hello") ; 233


#+begin_src ocaml
let ignore x = ()  
#+end_src

可见，分号表达式的主要作用是串联前面几个产生副作用的表达式，并在最后一个表达式中返回值。

*** 格式化输出

#+begin_src ocaml
utop # Printf.printf "%s %F\n %!" "hello" 3.14 
#+end_src

#+begin_src ocaml
hello 3.14
 - : unit = ()
#+end_src

~%!~ 用来刷写缓冲区，类似于std::endl

~%F~ 浮点数

~%i~ 整数


*** 格式化字符串

Printf.sprintf 会产生一个string







* list
ocaml 中的list是同类型元素构成的单链表： ~'a list~ 。
in OCaml, the list is first class status

ocaml 中的list是第一类的，这意味着有专门的语法支持list.
每个list节点是一个pair.  ~[]~ 表示空list.

** 创建list

有两种方式： 

+ 通过 ~::~ 链接元素
  
  必须在最后链接上一个空节点 ~[]~ 
  #+begin_src ocaml
    1::2::3::[]
    ;;
  #+end_src

+ 通过方括号和分号
  
  这种方式可以看作是上面那种方式的语法糖，可以省略链接空列表。
  #+begin_src ocaml
    [1;2;3]
    ;;
  #+end_src


** 用 ~@~ 连接两个list

#+begin_src ocaml
  let a = 1 :: 3 ::[] ;;
  let b = 2 :: 4 ::[] ;;

  a @ b ;;
  
  a @ [233] ;;
#+end_src














** 通过模式匹配 访问元素
#+begin_src ocaml
  match XX with
  | pattern1 -> do something
  | pattern2 -> do something
  | _ ->  ...
#+end_src

所谓模式就是数据的形式（样子），比如list可以是空的，也可以是不空的。
#+begin_src ocaml
  match lst with
  | [] -> 0
  | head :: tail -> head 
#+end_src
空list的形状就是 ~[]~ ，非空的列表意味着至少有一个有效元素： ~e :: []~ 
因此，其形状是 ~head::tail~ 。

有两种特殊的模式： ~_~ 和 ~x~ (x是随便一个符号名）
它们都能和任意的数据匹配上，不同之处在于匹配上的数据不会绑定到 ~_~ 上，但是会绑定到 ~x~ 上。
也就是说，在 ~->~ 右侧能否引用匹配上的值。
#+begin_src ocaml
  let rec length lst =
    match lst with
    | [] -> 0
    | h :: t -> 1 + length t
  ;;
#+end_src

在这个函数中的模式匹配里，第二个模式的 ~h~ 是没有必要的，因为箭头后面根本就没有使用 ~h~,

~List.hd/List.tl~ 分别能取出list的head和tail, 但是当他们作用于空列表 ~[]~ 时，会抛出异常。
而使用模式匹配的方式访问head/tail的好处是会强制你处理list的所有形式。




