ocaml-book.html


<div id="outline-container-orga412f5f" class="outline-3">
<h3 id="orga412f5f">打印</h3>
<div class="outline-text-3" id="text-orga412f5f">
<p>
print<sub>xxx</sub> :返回类型为unit.
</p>

<p>
唯一一个类型是unit的值是 <code>()</code>
类似于void，通常用于不关心输入参数/返回值时，这时候一般想利用函数的副作用。
</p>


<p>
在let in中要求我们必须为值进行绑定： x = val
对于返回类型为unit的函数：可以写成
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> func args <span style="font-weight: bold;">in</span> <span style="color: #f0e68c;">...</span>
</pre>
</div>

<p>
或者
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="color: #f0e68c;">()</span> <span style="color: #f0e68c;">=</span> func args <span style="font-weight: bold;">in</span> <span style="color: #f0e68c;">...</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">#</span>
<span style="font-weight: bold;">let</span> <span style="color: #f0e68c;">()</span>  <span style="color: #f0e68c;">=</span> print_endline <span style="color: #7bc275;">"fuck"</span> <span style="font-weight: bold;">in</span> 
<span style="font-weight: bold;">let</span> <span style="color: #f0e68c;">()</span>  <span style="color: #f0e68c;">=</span> print_endline <span style="color: #7bc275;">"your"</span> <span style="font-weight: bold;">in</span> 
print_endline <span style="color: #7bc275;">"mother"</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml">fuck
your
mother
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> unit <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">()</span>
</pre>
</div>

<p>
这种写法太繁琐了，可以像C中用逗号表达式分别对前面的表达式求值，但只将最后一个表达式的值返回。
在Ocaml中是用 <code>;</code> 来分割的：
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"hello"</span> <span style="color: #f0e68c;">;</span> 233  <span style="color: #62686E;">(* </span><span style="color: #62686E;">&#36825;&#20250;&#21457;&#20986;&#35686;&#21578; it will cause warnings</span><span style="color: #62686E;">*)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 233 
</pre>
</div>

<p>
因此可写成更简单的形式，而不用写成嵌套的 let..in..
</p>

<div class="org-src-container">
<pre class="src src-ocaml">print_endline <span style="color: #7bc275;">"fuck"</span><span style="color: #f0e68c;">;</span>
print_endline <span style="color: #7bc275;">"your"</span><span style="color: #f0e68c;">;</span>
print_endline <span style="color: #7bc275;">"mother"</span>  <span style="color: #62686E;">(* </span><span style="color: #62686E;">&#26368;&#21518;&#19968;&#20010;&#34920;&#36798;&#24335;&#21518;&#38754;&#26080;&#20998;&#21495;&#65281;</span><span style="color: #62686E;"> *)</span>
</pre>
</div>


<p>
在分号表达式中，若前面被忽略值的表达式的类型不是unit，则会发出警告。
通过ignore函数可以消除警告。
</p>

<p>
(ignore "hello") ; 233
</p>


<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="color: #C57BDB;">ignore</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">()</span>  
</pre>
</div>

<p>
可见，分号表达式的主要作用是串联前面几个产生副作用的表达式，并在最后一个表达式中返回值。
</p>
</div>

<div id="outline-container-org5ba3890" class="outline-4">
<h4 id="org5ba3890">格式化输出</h4>
<div class="outline-text-4" id="text-org5ba3890">
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="color: #FCCE7B;">Printf.</span>printf <span style="color: #7bc275;">"%s %F\n %!"</span> <span style="color: #7bc275;">"hello"</span> 3.14 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml">hello 3.14
 <span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> unit <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">()</span>
</pre>
</div>

<p>
<code>%!</code> 用来刷写缓冲区，类似于std::endl
</p>

<p>
<code>%F</code> 浮点数
</p>

<p>
<code>%i</code> 整数
</p>
</div>
</div>


<div id="outline-container-org5c4ce47" class="outline-4">
<h4 id="org5c4ce47">格式化字符串</h4>
<div class="outline-text-4" id="text-org5c4ce47">
<p>
Printf.sprintf 会产生一个string
</p>
</div>
</div>
</div>
</div>







<div id="outline-container-orgd5b11e8" class="outline-2">
<h2 id="orgd5b11e8">list</h2>
<div class="outline-text-2" id="text-orgd5b11e8">
<p>
ocaml 中的list是同类型元素构成的单链表： <code>'a list</code> 。
in OCaml, the list is first class status
</p>

<p>
ocaml 中的list是第一类的，这意味着有专门的语法支持list.
每个list节点是一个pair.  <code>[]</code> 表示空list.
</p>
</div>

<div id="outline-container-org7b1fdeb" class="outline-3">
<h3 id="org7b1fdeb">创建list</h3>
<div class="outline-text-3" id="text-org7b1fdeb">
<p>
有两种方式： 
</p>

<ul class="org-ul">
<li><p>
通过 <code>::</code> 链接元素
</p>

<p>
必须在最后链接上一个空节点 <code>[]</code> 
</p>
<div class="org-src-container">
<pre class="src src-ocaml">1<span style="color: #f0e68c;">::</span>2<span style="color: #f0e68c;">::</span>3<span style="color: #f0e68c;">::[]</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div></li>

<li><p>
通过方括号和分号
</p>

<p>
这种方式可以看作是上面那种方式的语法糖，可以省略链接空列表。
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">[</span>1<span style="color: #f0e68c;">;</span>2<span style="color: #f0e68c;">;</span>3<span style="color: #f0e68c;">]</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div></li>
</ul>
</div>
</div>


<div id="outline-container-orgd5dab6e" class="outline-3">
<h3 id="orgd5dab6e">用 <code>@</code> 连接两个list</h3>
<div class="outline-text-3" id="text-orgd5dab6e">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">a</span> <span style="color: #f0e68c;">=</span> 1 <span style="color: #f0e68c;">::</span> 3 <span style="color: #f0e68c;">::[]</span> <span style="color: #ff4500;">;;</span>
<span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">b</span> <span style="color: #f0e68c;">=</span> 2 <span style="color: #f0e68c;">::</span> 4 <span style="color: #f0e68c;">::[]</span> <span style="color: #ff4500;">;;</span>

a <span style="color: #f0e68c;">@</span> b <span style="color: #ff4500;">;;</span>

a <span style="color: #f0e68c;">@</span> <span style="color: #f0e68c;">[</span>233<span style="color: #f0e68c;">]</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>














<div id="outline-container-org5f957ba" class="outline-3">
<h3 id="org5f957ba">通过模式匹配 访问元素</h3>
<div class="outline-text-3" id="text-org5f957ba">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">match</span> <span style="color: #bbc2cf; background-color: #242730;">XX</span> <span style="color: #51afef;">with</span>
<span style="color: #f0e68c;">|</span> pattern1 <span style="color: #f0e68c;">-&gt;</span> <span style="color: #51afef;">do</span> something
<span style="color: #f0e68c;">|</span> pattern2 <span style="color: #f0e68c;">-&gt;</span> <span style="color: #51afef;">do</span> something
<span style="color: #f0e68c;">|</span> _ <span style="color: #f0e68c;">-&gt;</span>  <span style="color: #f0e68c;">...</span>
</pre>
</div>

<p>
所谓模式就是数据的形式（样子），比如list可以是空的，也可以是不空的。
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">match</span> lst <span style="color: #51afef;">with</span>
<span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> 0
<span style="color: #f0e68c;">|</span> head <span style="color: #f0e68c;">::</span> tail <span style="color: #f0e68c;">-&gt;</span> head 
</pre>
</div>
<p>
空list的形状就是 <code>[]</code> ，非空的列表意味着至少有一个有效元素： <code>e :: []</code> 
因此，其形状是 <code>head::tail</code> 。
</p>

<p>
有两种特殊的模式： <code>_</code> 和 <code>x</code> (x是随便一个符号名）
它们都能和任意的数据匹配上，不同之处在于匹配上的数据不会绑定到 <code>_</code> 上，但是会绑定到 <code>x</code> 上。
也就是说，在 <code>-&gt;</code> 右侧能否引用匹配上的值。
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="font-weight: bold;">rec</span> <span style="color: #5cEfFF;">length</span><span style="color: #DFDFDF;"> lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">match</span> lst <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> 0
  <span style="color: #f0e68c;">|</span> h <span style="color: #f0e68c;">::</span> t <span style="color: #f0e68c;">-&gt;</span> 1 <span style="color: #f0e68c;">+</span> length t
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
在这个函数中的模式匹配里，第二个模式的 <code>h</code> 是没有必要的，因为箭头后面根本就没有使用 <code>h</code>,
</p>

<p>
<code>List.hd/List.tl</code> 分别能取出list的head和tail, 但是当他们作用于空列表 <code>[]</code> 时，会抛出异常。
而使用模式匹配的方式访问head/tail的好处是会强制你处理list的所有形式。
</p>
</div>
</div>
</div>
