ocaml-book.html




<div id="outline-container-org9e50ae3" class="outline-2">
<h2 id="org9e50ae3">OUnit2</h2>
<div class="outline-text-2" id="text-org9e50ae3">
<p>
首先创建dune项目
</p>
<div class="org-src-container">
<pre class="src src-bash">dune init project yourproject
</pre>
</div>

<p>
在dune中链接ounit2:
</p>

<div class="org-src-container">
<pre class="src src-dune">(<span style="color: #51afef;">executable</span>
  (<span style="color: #5cEfFF;">name</span> test_xx)
  (<span style="color: #5cEfFF;">libraries</span> ounit2))
</pre>
</div>


<p>
创建测试文件  <code>test_xx.ml</code> 
引入ounit2和被测试的模块
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">open </span><span style="color: #FCCE7B;">Xx</span>
<span style="font-weight: bold;">open </span><span style="color: #FCCE7B;">OUnit2</span>

</pre>
</div>


<p>
为某个函数/功能创建测试套件：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"&#27979;&#35797;&#22871;&#20214;&#21517;"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>  <span style="color: #62686E;">(* </span><span style="color: #62686E;">&#27979;&#35797;&#39033;list</span><span style="color: #62686E;"> *)</span> <span style="color: #f0e68c;">]</span> 
</pre>
</div>

<p>
编写测试用例：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"&#27979;&#35797;&#39033;&#30446;&#21517;"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_xxx arg1 arg2 <span style="color: #f0e68c;">..</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
</pre>
</div>

<p>
运行一个测试套件：
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> run_test_tt_main &#27979;&#35797;&#22871;&#20214; 
</pre>
</div>



<p>
完整例子：
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="font-weight: bold;">open </span><span style="color: #FCCE7B;">OUnit2</span>
<span style="font-weight: bold;">open </span><span style="color: #FCCE7B;">Sum</span>

<span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">tests</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"test suite for sum"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>
    <span style="color: #7bc275;">"empty"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 0 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[])</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
    <span style="color: #7bc275;">"singleton"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 1 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[</span>1<span style="color: #f0e68c;">])</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
    <span style="color: #7bc275;">"two elements"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 3 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[</span>1<span style="color: #f0e68c;">;</span>2<span style="color: #f0e68c;">]));</span>
  <span style="color: #f0e68c;">]</span>

<span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> run_test_tt_main tests 
</pre>
</div>
</div>


<div id="outline-container-org79c5c1a" class="outline-3">
<h3 id="org79c5c1a">打印测试用例出错时的值</h3>
<div class="outline-text-3" id="text-org79c5c1a">
<p>
要给 <code>assert_xxx</code> 的 <code>printer</code> 参数传入一个输出字符串表达的函数，eg: <code>string_of_int</code> 
</p>
<div class="org-src-container">
<pre class="src src-ocaml">

<span style="font-weight: bold;">let</span> <span style="color: #DFDFDF;">mytsts</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"test suite for some module"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>
    <span style="color: #7bc275;">"case1"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 0 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[])</span> <span style="color: #a991f1;">~printer</span><span style="color: #f0e68c;">:</span>string_of_int <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
    <span style="color: #f0e68c;">]</span>
</pre>
</div>


<p>
会输出：
</p>
<pre class="example">
expected: 0 but got: 1
</pre>

<p>
从这个打印结果能看出，assert的首个参数应该是期望的值。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
